 Система Сборки Android Прошивок
---------------------------------
Android Firmware Construction Kit

AFCK это набор скриптов, используемых для (пере-)сборки прошивок ОС Android.
Целью данного набора является изготовление тюнингованных прошивок,
используя готовую прошивку производителя в качестве основы.

В настоящий момент данные проект может использоваться для сборки прошивок под:

    - Android TV приставка X96 Max

Для (пере)сборки прошивки используется сценарий для программы GNU Make
и набор POSIX-совместимых утилит. Наберите "make" без параметров чтобы
получить описание целей, которые можно собрать сценарием.
